In [1]:
import pandas as pd

In [8]:
# Reading csvs
departments=pd.read_csv("data/departments.csv")
dept_emp=pd.read_csv("data/dept_emp.csv")
dept_manager=pd.read_csv("data/dept_manager.csv")
employees=pd.read_csv("data/employees.csv")
salaries=pd.read_csv("data/salaries.csv")
titles=pd.read_csv("data/titles.csv")

In [22]:
# List the employee number, last name, first name, sex, and salary of each employee (2 points)
emp_with_salaries=employees.merge(salaries, on="emp_no", how="inner", suffixes=("_emp", "_salary"))
reduced_emp_with_salaries=emp_with_salaries[['emp_no','last_name','first_name', 
       'sex', 'salary']]

reduced_emp_with_salaries

        emp_no  last_name   first_name sex  salary
0       473302   Zallocco     Hideyuki   M   40000
1       475053  Delgrande        Byong   F   53422
2        57444       Babb        Berry   F   48973
3       421786   Verhoeff        Xiong   M   40000
4       282238    Baumann   Abdelkader   F   40000
...        ...        ...          ...  ..     ...
300019  464231    Eastman  Constantino   M   69696
300020  255832     Dayang       Yuping   F   75355
300021   76671   Plessier       Ortrud   M   61886
300022  264920   Samarati        Percy   F   62772
300023  464503  Slobodova       Arvind   M   41708

[300024 rows x 5 columns]

In [31]:
# List the first name, last name, and hire date for the employees who were hired in 1986 (2 points)
emp_with_salaries['hire_date'] = pd.to_datetime(emp_with_salaries['hire_date'])
emp_with_salaries_1986 = emp_with_salaries.loc[emp_with_salaries['hire_date'].dt.year == 1986]
emp_with_salaries_1986=emp_with_salaries_1986[['first_name', 'last_name', 'hire_date']]
emp_with_salaries_1986

       first_name    last_name  hire_date
5            Eran     Cusworth 1986-11-14
14          Bojan     Zallocco 1986-10-14
19          Nevio       Demizu 1986-05-18
29           Ziva       Vecchi 1986-07-03
33          Mohit        Speek 1986-01-14
...           ...          ...        ...
299986      Uriel     Heijenga 1986-06-30
299998      Ziyad  Constantine 1986-02-28
300006     Yishay   Maksimenko 1986-01-27
300007     Yannik        Ranai 1986-04-06
300017     Chenyi     Orlowska 1986-12-25

[36150 rows x 3 columns]

In [ ]:
# List the manager of each department along with their department number, department name, employee number, last name, and first name (2 points)
man_details=dept_manager.merge(salaries, on="emp_no", how="inner", suffixes=("_emp", "_salary"))

In [ ]:
# List the department number for each employee along with that employee’s employee number, last name, first name, and department name (2 points)

In [ ]:
# List first name, last name, and sex of each employee whose first name is Hercules and whose last name begins with the letter B (2 points)

In [ ]:
# List each employee in the Sales department, including their employee number, last name, and first name (2 points)

In [ ]:
# List each employee in the Sales and Development departments, including their employee number, last name, first name, and department name (4 points)

In [ ]:
# List the frequency counts, in descending order, of all the employee last names (that is, how many employees share each last name) (4 points)